In [1]:
import pandas as pd
df = pd.read_csv("simple_data.csv")

In [2]:
df.head()

   sirano     isim  yas       meslek     sehir  aylik_gelir
0       1    Cemal   35         Isci    Ankara         3500
1       2    Ceyda   42        Memur   Kayseri         4200
2       3    Timur   30     Müzisyen  Istanbul         9000
3       4    Burcu   29  Pazarlamaci    Ankara         4200
4       5  Yasemin   23  Pazarlamaci     Bursa         4800

In [3]:
# aylik_gelir'e göre sıralama

In [4]:
df.sort_values("aylik_gelir").head()

    sirano   isim  yas       meslek    sehir  aylik_gelir
0        1  Cemal   35         Isci   Ankara         3500
12      13  Hakkı   33        Memur    Çorum         3750
1        2  Ceyda   42        Memur  Kayseri         4200
3        4  Burcu   29  Pazarlamaci   Ankara         4200
11      12  Harun   43      Tornacı   Ankara         4200

# Azalan sıralama

In [5]:
# Varsayılan olarak sıralama artan sıralamadır. Büyükten küçüğe 
# sıralamak istersek sort_values() içine ascending=False
# demeliyiz.

In [6]:
df.sort_values("aylik_gelir", ascending=False).head()

    sirano      isim  yas    meslek     sehir  aylik_gelir
8        9     Ahmet   33    Doktor    Ankara        18000
13      14   Gülizar   37    Doktor     İzmir        14250
7        8     Murat   31  Müzisyen  Istanbul        12000
9       10  Muhittin   46    Berber  Istanbul        12000
2        3     Timur   30  Müzisyen  Istanbul         9000

# Filtreleme

In [7]:
# Mesleği doktor olanlar
# df[filtelemeyi sağlayacak koşul(lar)]

In [8]:
df[df.meslek == 'Doktor']

    sirano     isim  yas  meslek   sehir  aylik_gelir
8        9    Ahmet   33  Doktor  Ankara        18000
13      14  Gülizar   37  Doktor   İzmir        14250

In [9]:
# Doktor ve Ankara

In [10]:
df[(df["meslek"] == "Müzisyen") & 
   (df["aylik_gelir"] > 10000)]

   sirano   isim  yas    meslek     sehir  aylik_gelir
7       8  Murat   31  Müzisyen  Istanbul        12000

In [11]:
# Doktor ya da berber

In [15]:
df[(df["meslek"] == "Doktor") | 
   (df["meslek"] == "Berber")
  ]

    sirano      isim  yas  meslek     sehir  aylik_gelir
8        9     Ahmet   33  Doktor    Ankara        18000
9       10  Muhittin   46  Berber  Istanbul        12000
13      14   Gülizar   37  Doktor     İzmir        14250
15      16    Gençay   46  Berber    Ankara         8800
16      16    Gençay   46  Berber    Ankara         8800

# unique() ile benzersiz kategorileri elde etme

In [17]:
df.meslek.unique()

array(['Isci', 'Memur', 'Müzisyen', 'Pazarlamaci', 'Doktor', 'Berber',
       'Tuhafiyeci', 'Tornacı'], dtype=object)